In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df=pd.read_csv("heights (2).csv")

In [7]:
df.head(6)

     name  height
0   mohan     1.2
1   maria     2.3
2   sakib     4.9
3     tao     5.1
4   virat     5.2
5  khusbu     5.4

In [5]:
df.shape

(20, 2)

In [6]:
df.describe()

          height
count  20.000000
mean    8.390000
std     8.782812
min     1.200000
25%     5.350000
50%     5.700000
75%     6.275000
max    40.200000

In [8]:
df.height.sort_values()

0      1.2
1      2.3
2      4.9
3      5.1
4      5.2
5      5.4
6      5.5
7      5.5
9      5.6
8      5.6
10     5.8
11     5.9
12     6.0
13     6.1
14     6.2
15     6.5
16     7.1
17    14.5
18    23.2
19    40.2
Name: height, dtype: float64

In [9]:
q1=df['height'].quantile(0.25)
q3=df['height'].quantile(0.75)
q1,q3

(5.3500000000000005, 6.275)

In [10]:
IQR=q3-q1

In [11]:
IQR

0.9249999999999998

In [12]:
upper_limit=q3+1.5*IQR
lower_limit=q1-1.5*IQR
lower_limit,upper_limit

(3.962500000000001, 7.6625)

In [14]:
df[(df['height']<lower_limit) | (df['height']>upper_limit)]

     name  height
0   mohan     1.2
1   maria     2.3
17  aamir    14.5
18    ken    23.2
19    Liu    40.2

In [15]:
df[(df['height']>lower_limit) & (df['height']<upper_limit)]

       name  height
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1